window.onresize=function(){
    დაფა.დაალაგე()
    უკანა_დაფა.დაალაგე()
}

var გლობალური_ხ=0, გლობალური_ჯ=0

var საცავი = {
    ნაწყვეტები:{},
    მომე_სურათი: function(პოზიცია, სიგრძე, სიგანე){
        
    }
}

function მითხარი_ხოლმე_რაც_მოხდება(უკუძახილი){
    var მოთხოვნა = new XMLHttpRequest()
    var ბოლო_ნაქნარის_დრო=0
    
    function ახალი_მოთხოვნა(){
        მოთხოვნა.onreadystatechange=function(){
            if(მოთხოვნა.readyState==4){
                console.log(მოთხოვნა.response)
                if(მოთხოვნა.status==200){
                    var ნაქნარები=jSON.parse(მოთხოვნა.response);
                    ბოლო_ნაქნარის_დრო=ნაქნარები[ნაქნარები.lenght-1].დრო
                    ახალი_მოთხოვნა()
                }
            }
        }
        მოთხოვნა.open("GET", '/რა-მოხდა?როდიდან='+ბოლო_ნაქნარის_დრო+'&r='+Math.random(), true)
        მოთხოვნა.send()
    }
    
    ახალი_მოთხოვნა()
}

მითხარი_ხოლმე_რაც_მოხდება()

function გააგზავნე_ობიექტი(მისამართზე, ობიექტი){
    var მოთხოვნა = new XMLHttpRequest()
    მოთხოვნა.open("POST", მისამართზე, true)
    მოთხოვნა.send(ობიექტი)
}

function გააგზავნე(მისამართზე){
    var მოთხოვნა = new XMLHttpRequest()
    მოთხოვნა.open("GET", მისამართზე, true)
    მოთხოვნა.send()
}

function მომე_გლობალური_კოორდინატები(დაფა, ლოკალური_ხ, ლოკალური_ჯ){
    return {ხ:დაფა.გლობ_ხ+ლოკალური_ხ, ჯ:დაფა.გლობ_ჯ+ლოკალური_ჯ}
}

function მომე_ლოკალური_კოორდინატები(დაფა, გლობალური_ხ, გლობალური_ჯ){
    return {ხ:გლობალური_ხ-დაფა.გლობ_ხ, ჯ:გლობალური_ჯ-დაფა.გლობ_ჯ}
}

var დაფა=function(){
    var that={
        კანტი:{ხ:512,ჯ:512},
        დაალაგე:function(){
            this.ნახაზი.width=window.innerWidth+this.კანტი.ხ*2
            this.ნახაზი.height=window.innerHeight+this.კანტი.ჯ*2
            this.გამოთვალე_კოორდინატები()
        },
        გამოთვალე_კოორდინატები:function(){
            this.გლობ_ხ=გლობალური_ხ-Math.floor(this.ნახაზი.width/2),
            this.გლობ_ჯ=გლობალური_ჯ-Math.floor(this.ნახაზი.height/2)
        },
        წანაცვლდი:function(ხ_ცვლილება, ჯ_ცვლილება){
            გლობალური_ხ+=ხ_ცვლილება
            გლობალური_ჯ+=ჯ_ცვლილება
            
            var სურათი = this.კონტ.getImageData(-ხ_ცვლილება, -ჯ_ცვლილება, 
                this.ნახაზი.width, this.ნახაზი.height)
            this.კონტ.putImageData(სურათი, 0, 0)
            
            this.გამოთვალე_კოორდინატები()
            // დასამატებელია მომსახურედან ნაწყვეტის წამოღება
        },
        მომე_ფრაგმენტი:function(ხ,ჯ,სიგანე,სიმაღლე){
            var ლოკ = მომე_ლოკალური_კოორდინატები(this, ხ,ჯ)
            
            var სურათი = this.კონტ.getImageData(ლოკ.ხ, ლოკ.ჯ, სიგანე, სიმაღლე)
            
            return სურათი
        }
    }
    
    that.ნახაზი=document.getElementById('დაფა')
    that.კონტ=that.ნახაზი.getContext('2d')
    
    that.ნახაზი.onmousedown=function(მოვლ){
        მიჭირავს.დაიწყე(მოვლ.clientX, მოვლ.clientY)
    }
    that.ნახაზი.onmousemove=function (მოვლ){
        მიჭირავს.გაამოძრავე(მოვლ.clientX, მოვლ.clientY)
    }
    that.ნახაზი.onmouseup=function (მოვლ){
        მიჭირავს.დაასრულე(მოვლ.clientX, მოვლ.clientY)
    }
    that.ნახაზი.oncontextmenu=function(){
        მიჭირავს=მიჭირავს==ხელი?ფუნჯი:ხელი
        return false
    }
    return that
}()

დაფა.დაალაგე()

var ფუნჯი = {
    იხატება: false,
    გზას_მიუმატე:function(ხ,ჯ){
        var გლობ=მომე_გლობალური_კოორდინატები(დაფა, ხ,ჯ)
        this.გზა.push({ხ:გლობ.ხ,ჯ:გლობ.ჯ,დრო:new Date().getTime()})
    },
    დაიწყე: function(ხ, ჯ){
        this.იხატება=true
        
        დაფა.კონტ.beginPath()
        დაფა.კონტ.moveTo(დაფა.კანტი.ხ+ხ, დაფა.კანტი.ხ+ჯ)
        
        this.გზა=[]
        this.გზას_მიუმატე(ხ,ჯ)
    },
    გაამოძრავე: function(ხ, ჯ){
        if(this.იხატება){
            დაფა.კონტ.lineTo(დაფა.კანტი.ხ+ხ,დაფა.კანტი.ხ+ჯ)
            დაფა.კონტ.stroke()
                
            this.გზას_მიუმატე(ხ,ჯ)
        }
    },
    დაასრულე: function(ხ, ჯ){
        this.იხატება=false
        
        var გასაგზავნი_გზა=[]
        for(var ი=0;ი<this.გზა.length-1;ი++){
            var ესგზა=this.გზა[ი]
            var მერეგზა=this.გზა[ი+1]
            გასაგზავნი_გზა.push({
                ხ:ესგზა.ხ, 
                ჯ:ესგზა.ჯ, 
                დრო:მერეგზა.დრო-ესგზა.დრო
            })
        }
        var გზისბოლო=this.გზა[this.გზა.length-1]
        გასაგზავნი_გზა.push({
                ხ:გზისბოლო.ხ, 
                ჯ:გზისბოლო.ჯ
            })
            
        გააგზავნე_ობიექტი('/ვქენი', JSON.stringify(გასაგზავნი_გზა))
    },
}

var ხელი = {
    გადამაქვს: false,
    დაიწყე: function(ხ, ჯ){
        this.გადამაქვს=true
        this.წინა={ხ:ხ,ჯ:ჯ}
    },
    გაამოძრავე: function(ხ, ჯ){
        if(this.გადამაქვს){
            var ხ_ცვლილება = ხ-this.წინა.ხ,
                ჯ_ცვლილება = ჯ-this.წინა.ჯ
            
            დაფა.წანაცვლდი(ხ_ცვლილება, ჯ_ცვლილება)
            
            this.წინა={ხ:ხ,ჯ:ჯ}
        }
    },
    დაასრულე: function(ხ, ჯ){
        this.გადამაქვს=false
        
        გააგზავნე('/წავნაცვლდი?ხ='+დაფა.გლობ_ხ+'&ჯ='+დაფა.გლობ_ჯ+
                '&სიგანე='+დაფა.ნახაზი.width+'&სიმაღლე='+დაფა.ნახაზი.height)
    },
}

var მიჭირავს=ფუნჯი