window.onresize=function(){
    დაფა.დაალაგე()
    უკანა_დაფა.დაალაგე()
}

var გლობალური_ხ=0, გლობალური_ჯ=0

var საცავი = {
    ნაწყვეტები:{},
    მომე_სურათი: function(პოზიცია, სიგრძე, სიგანე){
        
    }
}

function გააგზავნე_წანაცვლება(){
    var ხედვის_არე={
        ხ:უკანა_დაფა.გლობ_ხ,
        ჯ:უკანა_დაფა.გლობ_ჯ,
        სიგანე:უკანა_დაფა.ნახაზი.width,
        სიმაღლე:უკანა_დაფა.ნახაზი.height,
    }
    
    გააგზავნე('/წავნაცვლდი?ხ='+ხედვის_არე.ხ+'&ჯ='+ხედვის_არე.ჯ+
            '&სიგანე='+ხედვის_არე.სიგანე+'&სიმაღლე='+ხედვის_არე.სიმაღლე)
}



function გააგზავნე_ობიექტი(მისამართზე, ობიექტი){
    var მოთხოვნა = new XMLHttpRequest()
    მოთხოვნა.open("POST", მისამართზე, true)
    მოთხოვნა.send(ობიექტი)
}

function გააგზავნე(მისამართზე){
    var მოთხოვნა = new XMLHttpRequest()
    მოთხოვნა.open("GET", მისამართზე, true)
    მოთხოვნა.send()
}

function მომე_გლობალური_კოორდინატები(დაფა, ლოკალური_ხ, ლოკალური_ჯ){
    return {ხ:დაფა.გლობ_ხ+ლოკალური_ხ, ჯ:დაფა.გლობ_ჯ+ლოკალური_ჯ}
}

function მომე_ლოკალური_კოორდინატები(დაფა, გლობალური_ხ, გლობალური_ჯ){
    return {ხ:გლობალური_ხ-დაფა.გლობ_ხ, ჯ:გლობალური_ჯ-დაფა.გლობ_ჯ}
}

var დაფა = function(){
    var that = {
        კანტი:{ხ:0,ჯ:0},
        დაალაგე:function(){
            this.ნახაზი.width=window.innerWidth
            this.ნახაზი.height=window.innerHeight
            this.გამოთვალე_კოორდინატები()
        },
        გამოთვალე_კოორდინატები:function(){
            this.გლობ_ხ=გლობალური_ხ-Math.floor(this.ნახაზი.width/2),
            this.გლობ_ჯ=გლობალური_ჯ-Math.floor(this.ნახაზი.height/2)
        },
        წანაცვლდი:function(ხ_ცვლილება, ჯ_ცვლილება){
            გლობალური_ხ+=ხ_ცვლილება
            გლობალური_ჯ+=ჯ_ცვლილება

            var სურათი = უკანა_დაფა.მომე_ფრაგმენტი(this.გლობ_ხ-ხ_ცვლილება, this.გლობ_ჯ-ჯ_ცვლილება, 
                this.ნახაზი.width, this.ნახაზი.height)
            this.კონტ.putImageData(სურათი, 0, 0)
            
            this.გამოთვალე_კოორდინატები()
        }
    }
    
    that.ნახაზი=document.getElementById('დაფა')
    that.კონტ=that.ნახაზი.getContext('2d')
    
    that.ნახაზი.onmousedown=function(მოვლ){
        მიჭირავს.დაიწყე(მოვლ.clientX, მოვლ.clientY)
    }
    that.ნახაზი.onmousemove=function (მოვლ){
        მიჭირავს.გაამოძრავე(მოვლ.clientX, მოვლ.clientY)
    }
    that.ნახაზი.onmouseup=function (მოვლ){
        მიჭირავს.დაასრულე(მოვლ.clientX, მოვლ.clientY)
    }
    that.ნახაზი.oncontextmenu=function(){
        მიჭირავს=მიჭირავს==ხელი?ფუნჯი:ხელი
        return false
    }
    return that
}()

var უკანა_დაფა=function(){
    var that={
        კანტი:{ხ:512,ჯ:512},
        დაალაგე:function(){
            if(!this.კონტ){
                this.კონტ=this.ნახაზი.getContext('2d')
            }
            this.ნახაზი.width=window.innerWidth+this.კანტი.ხ*2
            this.ნახაზი.height=window.innerHeight+this.კანტი.ჯ*2
            this.გამოთვალე_კოორდინატები()
        },
        გამოთვალე_კოორდინატები:function(){
            this.გლობ_ხ=გლობალური_ხ-Math.floor(this.ნახაზი.width/2),
            this.გლობ_ჯ=გლობალური_ჯ-Math.floor(this.ნახაზი.height/2)
        },
        წანაცვლდი:function(ხ_ცვლილება, ჯ_ცვლილება){
            var სურათი = this.კონტ.getImageData(-ხ_ცვლილება, -ჯ_ცვლილება, 
                this.ნახაზი.width, this.ნახაზი.height)
            this.კონტ.putImageData(სურათი, 0, 0)
            
            this.გამოთვალე_კოორდინატები()
            // დასამატებელია მომსახურედან ნაწყვეტის წამოღება
        },
        მომე_ფრაგმენტი:function(ხ,ჯ,სიგანე,სიმაღლე){
            var ლოკ = მომე_ლოკალური_კოორდინატები(this, ხ,ჯ)
            
            console.log(ხ,ჯ,სიგანე, სიმაღლე, ლოკ)
            var სურათი = this.კონტ.getImageData(ლოკ.ხ, ლოკ.ჯ, სიგანე, სიმაღლე)
            
            return სურათი
        }
    }
    that.ნახაზი=document.createElement('canvas')
    that.კონტ=that.ნახაზი.getContext('2d')
    
    return that
}()

დაფა.დაალაგე()
უკანა_დაფა.დაალაგე()

function ყველა_დაფისთვის(უკუძახილი){
    უკუძახილი(დაფა)
    უკუძახილი(უკანა_დაფა)
}

var ფუნჯი = {
    იხატება: false,
    გზას_მიუმატე:function(ხ,ჯ){
        var გლობ=მომე_გლობალური_კოორდინატები(დაფა, ხ,ჯ)
        this.გზა.push({ხ:გლობ.ხ,ჯ:გლობ.ჯ,დრო:new Date().getTime()})
    },
    დაიწყე: function(ხ, ჯ){
        this.იხატება=true
        
        ყველა_დაფისთვის(function(დაფა){
            დაფა.კონტ.beginPath()
            დაფა.კონტ.moveTo(დაფა.კანტი.ხ+ხ, დაფა.კანტი.ხ+ჯ)
        })
        
        this.გზა=[]
        this.გზას_მიუმატე(ხ,ჯ)
    },
    გაამოძრავე: function(ხ, ჯ){
        if(this.იხატება){
            ყველა_დაფისთვის(function(დაფა){
                დაფა.კონტ.lineTo(დაფა.კანტი.ხ+ხ,დაფა.კანტი.ხ+ჯ)
                დაფა.კონტ.stroke()
            })
            this.გზას_მიუმატე(ხ,ჯ)
        }
    },
    დაასრულე: function(ხ, ჯ){
        this.იხატება=false
        
        var გასაგზავნი_გზა=[]
        for(var ი=0;ი<this.გზა.length-1;ი++){
            var ესგზა=this.გზა[ი]
            var მერეგზა=this.გზა[ი+1]
            გასაგზავნი_გზა.push({
                ხ:ესგზა.ხ, 
                ჯ:ესგზა.ჯ, 
                დრო:მერეგზა.დრო-ესგზა.დრო
            })
        }
        var გზისბოლო=this.გზა[this.გზა.length-1]
        გასაგზავნი_გზა.push({
                ხ:გზისბოლო.ხ, 
                ჯ:გზისბოლო.ჯ
            })
            
        გააგზავნე_ობიექტი('/ვქენი', JSON.stringify(გასაგზავნი_გზა))
    },
}

var ხელი = {
    გადამაქვს: false,
    დაიწყე: function(ხ, ჯ){
        this.გადამაქვს=true
        this.წინა={ხ:ხ,ჯ:ჯ}
    },
    გაამოძრავე: function(ხ, ჯ){
        if(this.გადამაქვს){
            var ხ_ცვლილება = ხ-this.წინა.ხ,
                ჯ_ცვლილება = ჯ-this.წინა.ჯ
            
            დაფა.წანაცვლდი(ხ_ცვლილება, ჯ_ცვლილება)
            უკანა_დაფა.წანაცვლდი(ხ_ცვლილება, ჯ_ცვლილება)
            
            this.წინა={ხ:ხ,ჯ:ჯ}
        }
    },
    დაასრულე: function(ხ, ჯ){
        this.გადამაქვს=false
        გააგზავნე_წანაცვლება()
    },
}

var მიჭირავს=ფუნჯი