window.onresize=function(){
    დაფა.width=window.innerWidth
    დაფა.height=window.innerHeight
    გამოთვალე_დაფის_კოორდინატები()
}

var დაფა = document.getElementById('დაფა')
დაფა.width=window.innerWidth
დაფა.height=window.innerHeight
var კონტ = დაფა.getContext('2d')

var გლობალური_ხ=0, გლობალური_ჯ=0, ხ_კანტი=512, ჯ_კანტი=512
გამოთვალე_დაფის_კოორდინატები()

var საცავი = {
    ნაწყვეტები:{},
    მომე_სურათი: function(პოზიცია, სიგრძე, სიგანე){
        
    }
}

function გამოთვალე_დაფის_კოორდინატები(){
    დაფის_გლობ_ხ=გლობალური_ხ-Math.floor(დაფა.width/2),
    დაფის_გლობ_ჯ=გლობალური_ჯ-Math.floor(დაფა.height/2)
}

function წავნაცვლდი(ხ_ცვლილება,ჯ_ცვლილება){
    გლობალური_ხ+=ხ_ცვლილება
    გლობალური_ჯ+=ჯ_ცვლილება
    გამოთვალე_დაფის_კოორდინატები()
}

function გააგზავნე_წანაცვლება(){
    console.log(დაფის_გლობ_ხ,დაფის_გლობ_ჯ)
    var ხედვის_არე={
        ხ:დაფის_გლობ_ხ-ხ_კანტი,
        ჯ:დაფის_გლობ_ჯ-ჯ_კანტი,
        სიგანე:დაფა.width+2*ხ_კანტი,
        სიმაღლე:დაფა.height+2*ჯ_კანტი,
    }
    
    console.log(ხედვის_არე)
    გააგზავნე('/წავნაცვლდი?ხ='+ხედვის_არე.ხ+'&ჯ='+ხედვის_არე.ჯ+
            '&სიგანე='+ხედვის_არე.სიგანე+'&სიმაღლე='+ხედვის_არე.სიმაღლე)
}

function მომე_გლობალური_კოორდინატები(ლოკალური_ხ, ლოკალური_ჯ){
    return {ხ:დაფის_გლობ_ხ+ლოკალური_ხ, ჯ:დაფის_გლობ_ჯ+ლოკალური_ჯ}
}
function მომე_ლოკალური_კოორდინატები(გლობალური_ხ, გლობალური_ჯ){
}

function გააგზავნე_ობიექტი(მისამართზე, ობიექტი){
    var მოთხოვნა = new XMLHttpRequest()
    მოთხოვნა.open("POST", მისამართზე, true)
    მოთხოვნა.send(ობიექტი)
}

function გააგზავნე(მისამართზე){
    var მოთხოვნა = new XMLHttpRequest()
    მოთხოვნა.open("GET", მისამართზე, true)
    მოთხოვნა.send()
}

var ფუნჯი = {
    კონტ:კონტ,
    იხატება: false,
    გზას_მიუმატე:function(ხ,ჯ){
        var გლობ=მომე_გლობალური_კოორდინატები(ხ,ჯ)
        this.გზა.push({ხ:გლობ.ხ,ჯ:გლობ.ჯ,დრო:new Date().getTime()})
    },
    დაიწყე: function(ხ, ჯ){
        this.იხატება=true
        this.კონტ.beginPath()
        this.კონტ.moveTo(ხ, ჯ)
        this.გზა=[]
        this.გზას_მიუმატე(ხ,ჯ)
    },
    გაამოძრავე: function(ხ, ჯ){
        if(this.იხატება){
            this.კონტ.lineTo(ხ,ჯ)
            this.კონტ.stroke()
            this.გზას_მიუმატე(ხ,ჯ)
        }
    },
    დაასრულე: function(ხ, ჯ){
        this.იხატება=false
        
        var გასაგზავნი_გზა=[]
        for(var ი=0;ი<this.გზა.length-1;ი++){
            var ესგზა=this.გზა[ი]
            var მერეგზა=this.გზა[ი+1]
            გასაგზავნი_გზა.push({
                ხ:ესგზა.ხ, 
                ჯ:ესგზა.ჯ, 
                დრო:მერეგზა.დრო-ესგზა.დრო
            })
        }
        var გზისბოლო=this.გზა[this.გზა.length-1]
        გასაგზავნი_გზა.push({
                ხ:გზისბოლო.ხ, 
                ჯ:გზისბოლო.ჯ
            })
            
        გააგზავნე_ობიექტი('/ვქენი', JSON.stringify(გასაგზავნი_გზა))
    },
}

var ხელი = {
    კონტ:კონტ,
    გადამაქვს: false,
    დაიწყე: function(ხ, ჯ){
        this.გადამაქვს=true
        this.წინა={ხ:ხ,ჯ:ჯ}
    },
    გაამოძრავე: function(ხ, ჯ){
        if(this.გადამაქვს){
            var ხ_ცვლილება = ხ-this.წინა.ხ,
                ჯ_ცვლილება = ჯ-this.წინა.ჯ
            
            var სურათი = this.კონტ.getImageData(-ხ_ცვლილება, -ჯ_ცვლილება, 
                this.კონტ.canvas.width, this.კონტ.canvas.height)
            this.კონტ.putImageData(სურათი, 0, 0)
            
            this.წინა={ხ:ხ,ჯ:ჯ}
            წავნაცვლდი(ხ_ცვლილება, ჯ_ცვლილება)
        }
    },
    დაასრულე: function(ხ, ჯ){
        this.გადამაქვს=false
        გააგზავნე_წანაცვლება()
    },
}

var მიჭირავს=ფუნჯი

დაფა.onmousedown=function(მოვლ){
    მიჭირავს.დაიწყე(მოვლ.clientX, მოვლ.clientY)
}
დაფა.onmousemove=function (მოვლ){
    მიჭირავს.გაამოძრავე(მოვლ.clientX, მოვლ.clientY)
}
დაფა.onmouseup=function (მოვლ){
    მიჭირავს.დაასრულე(მოვლ.clientX, მოვლ.clientY)
}
დაფა.oncontextmenu=function(){
    მიჭირავს=მიჭირავს==ხელი?ფუნჯი:ხელი
    return false
}