var ზტაე = '<!DOCTYPE html>'+
        '<html>'+
            '<head>'+
                '<link rel="stylesheet" href="/სახე.css">'+
            '</head>'+
            '<body>'+
                '<div id="მთავარი_ნაჭერი">'+
                '<canvas id="დაფა"">'+
                '</canvas>'+
                '<div id="სახარახურე" class="სახარახურე">'+
                '<div id="სხვა_დანარჩენი_შიგთავსი" class="დამალული">'+
                '<h3 data-თარგმანი="სხვა დანარჩენი">სხვა დანარჩენი</h3>'+
                    '<p data-თარგმანი="სხვა დანარჩენი შიგთავსი">ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. ყველაფერი, რაც გარეთ არ ჩანს. </p>'+
                '</div>'+
                '<div id="სახარახურე_შიგთავსი">'+
                    '<div>'+
                        '<img alt="ლოგო" src="/სურათები/ლოგო.png"><br/>'+
                        '<h2>'+
                        '<span data-თარგმანი="დიდი დაფა">'+
                        'დიდი დაფა'+
                        '</span>'+
                        '</h2>'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<select id="ენა">'+
                        '</select>'+
                    '</div>'+
                    '<div>'+
                        '<input type="text" id="სახელი"/>'+
                    '</div>'+
                    '<div id="ფერები">'+
                    '</div>'+
                    '<div id="მომხმარებლები">'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<span data-თარგმანი="მდებარეობა">'+
                        'მდებარეობა'+
                        '</span>'+
                        '<input type="text" id="მდებარეობა_ხ" class="სავსე"/>'+
                        '<input type="text" id="მდებარეობა_ჯ" class="სავსე"/>'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<span data-თარგმანი="ინსტრუქციები">'+
                        'ინსტრუქციები'+
                        '</span>'+
                        '<p class="ტექსტი_სახარახურეში">'+
                        '<span data-თარგმანი="ინსტრუქციების ტანი">'+
                        'დააჭირე მარჯვენას რომ შეცვალო იარაღი.'+
                        '</span>'+
                        '</p>'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<input id="სხვა_დანარჩენი" type="submit" data-თარგმანი="სხვა დანარჩენი" value="სხვა დანარჩენი" class="სავსე"/>'+
                    '</div>'+
                '</div>'+
                '</div>'+
                '</div>'+
                '<script type="text/javascript" src="/საცხობი.js"></script>'+
                '<script type="text/javascript" src="/ფერების-ასარჩევი.js"></script>'+
                '<script type="text/javascript" src="/გულ-ღვიძლი.js"></script>'+
                '<script type="text/javascript" src="/სახარახურე.js"></script>'+
            '</body>'+
        '</html>'

exports.ჩაუშვი=function(მოთხ, პასუხ){
    პასუხ.end(ზტაე)
}
