var ზტაე = '<!DOCTYPE html>'+
        '<html>'+
            '<head>'+
                '<link rel="stylesheet" href="/სახე.css">'+
            '</head>'+
            '<body>'+
                '<div id="მთავარი_ნაჭერი">'+
                '<canvas id="დაფა"">'+
                '</canvas>'+
                '<div id="სახარახურე" class="სახარახურე">'+
                '<div id="სხვა_დანარჩენი_შიგთავსი" class="დამალული">'+
                '<h3 data-თარგმანი="სხვა დანარჩენი">სხვა დანარჩენი</h3>'+
                    '<p data-თარგმანი="სხვა დანარჩენი დახასიათება">დიდი დაფა არის საერთო სახატავი ქსელ-ნაკვეთი ბევრი ადამიანისთვის.'+
                    ' იგი არის თავისუფალი პროგრამული უზრუნველყოფა, რაც ითვალისწინებს თანმდევი კოდის გამრავლების, ცვლილებების და საკუთარი მიზნებით გამოყენების უფლებებს.'+
                    ' დამატებითი ინფორმაციისთვის გაეცანით ზსლ ლიცენზიას.</p>'+
                    '<div class="სათაური" data-თარგმანი="კონფიდენციალობის პოლიტიკა">კონფიდენციალობის პოლიტიკა</div>'+
                    '<p data-თარგმანი="სხვა დანარჩენი კონფიდენციალობის პოლიტიკა">დიდი დაფა არ ინახავს პერსონალურად იდენტიფიცირებად ინფორმაციას.'+
                    'მხოლოდ შესაძლებელია რამდენიმე დღით შენახული იქნას სპ მისამართები მომხმარებლების დღიური რაოდენობის დათვლის მიზნით.</p>'+
                    '<div class="სათაური" data-თარგმანი="პასუხისმგებლობა">პასუხისმგებლობა</div>'+
                    '<p data-თარგმანი="სხვა დანარჩენი პასუხისმგებლობა">დიდი დაფა არ აგებს პასუხს ნებისმიერ მიყენებულ ზარალზე. გამოიყენეთ იგი საკუთარი რისკის ფასად.</p>'+
                    '<div class="სათაური" data-თარგმანი="მადლობა">მადლობა</div>'+
                    '<p data-თარგმანი="სხვა დანარჩენი მადლობა">მადლობა ყველას, ვინც მონაწილეობა მიიღო დიდი დაფას შექმნაში, თარგმნაში და ა.შ.</p>'+
                    '<div class="სათაური" data-თარგმანი="ბმულები">ბმულები</div>'+
                    '<p><a href="https://bitbucket.org/rimnadze/didi-dafa/"><span data-თარგმანი="დიდი დაფა პროექტის ქსელ-გვერდი">დიდი დაფა პროექტის ქსელ-გვერდი</span></a><br/>'+
                    '<a href="https://gnu.org/licenses/gpl.html"><span data-თარგმანი="გნუს ზოგადი საჯარო ლიცენზია">გნუს ზოგადი საჯარო ლიცენზია</span></a></p>'+
                '</div>'+
                '<div id="სახარახურე_შიგთავსი">'+
                    '<div>'+
                        '<img alt="ლოგო" src="/სურათები/ლოგო.png"><br/>'+
                        '<h2>'+
                        '<span data-თარგმანი="დიდი დაფა">'+
                        'დიდი დაფა'+
                        '</span>'+
                        '</h2>'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<select id="ენა">'+
                        '</select>'+
                    '</div>'+
                    '<div>'+
                        '<input type="text" id="სახელი"/>'+
                    '</div>'+
                    '<div id="ფერები">'+
                    '</div>'+
                    '<div id="მომხმარებლები">'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<span data-თარგმანი="მდებარეობა">'+
                        'მდებარეობა'+
                        '</span>'+
                        '<input type="text" id="მდებარეობა_ხ" class="სავსე"/>'+
                        '<input type="text" id="მდებარეობა_ჯ" class="სავსე"/>'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<span data-თარგმანი="ინსტრუქციები">'+
                        'ინსტრუქციები'+
                        '</span>'+
                        '<p class="ტექსტი_სახარახურეში">'+
                        '<span data-თარგმანი="ინსტრუქციების ტანი">'+
                        'დააჭირე მარჯვენას რომ შეცვალო ხელსაწყო.'+
                        '</span>'+
                        '</p>'+
                    '</div>'+
                    '<hr/>'+
                    '<div>'+
                        '<input id="უკუკავშირი" type="submit" data-თარგმანი="უკუკავშირი" value="უკუკავშირი" class="სავსე"/>'+
                        '<input id="სხვა_დანარჩენი" type="submit" data-თარგმანი="სხვა დანარჩენი" value="სხვა დანარჩენი" class="სავსე"/>'+
                    '</div>'+
                '</div>'+
                '</div>'+
                '</div>'+
                '<script type="text/javascript" src="/საცხობი.js"></script>'+
                '<script type="text/javascript" src="/ფერების-ასარჩევი.js"></script>'+
                '<script type="text/javascript" src="/გულ-ღვიძლი.js"></script>'+
                '<script type="text/javascript" src="/სახარახურე.js"></script>'+
            '</body>'+
        '</html>'

exports.ჩაუშვი=function(მოთხ, პასუხ){
    პასუხ.end(ზტაე)
}
