var ფს = require('fs'),
    ლექსიკონი={}

module.exports = function(){
    ფს.readdir('თარგმანი', function(შეც, ფაილები){
        if(შეც){console.log(შეც); return}
        
        for(var ფ in ფაილები){
            var ფაილი = ფაილები[ფ]
            
            ფს.readFile('თარგმანი/'+ფაილი, function(ენა){
                return function(შეც, შიგთავსი){
                    if(შეც){console.log(შეც); return}
                    
                    ლექსიკონი[ენა]=მოხარშე(შიგთავსი.toString())
                }
            }(ფაილი))
            
        }
    })
    
    return {
        მომე:მომე,
        ენები:ენები,
        ყველა_თარგმანი:ყველა_თარგმანი,
    }
}

function მომე_მნიშვნელობა(ენა, გასაღები){
    return ლექსიკონი[ენა][გასაღები]
}

function მომე(ენა){
    return ლექსიკონი[ენა]
}

function მოხარშე(უმი){
    var ნაჭრები = უმი.split('\n\n'),
        მთლიანი={}
    
    for(var ნ in ნაჭრები){
        var ნაჭერი=ნაჭრები[ნ],
            ერთეულები=ნაჭერი.split('\n'),
            გასაღები, მნიშვნელობა
           
        var კომენტარის_მთვლელი=0
        
        for(var ე in ერთეულები){
            var ერთეული = ერთეულები[ე]
            
            if(ერთეული[0]!='#'){
                break
            }
            კომენტარის_მთვლელი++
        }
        
        var გასაღები = ერთეულები[კომენტარის_მთვლელი].trim()
            მნიშვნელობა = ''
        for(var ი=კომენტარის_მთვლელი+1;ი<ერთეულები.length;ი++){
            მნიშვნელობა+=ერთეულები[ი]
        }
        
        if(მნიშვნელობა.trim()===""){
            მნიშვნელობა=გასაღები
        }
        
        მთლიანი[გასაღები]=მნიშვნელობა.trim()
    }
    return მთლიანი
}

function ენები(){
    return Object.keys(ლექსიკონი)
}

function არსებობს(ენა){
    return ლექსიკონი[ენა]?true:false
}

function ყველა_თარგმანი(გასაღები){
    var თარგმნები=[]
    
    for(var ე in ლექსიკონი){
        var ენა = ლექსიკონი[ე]
        
        var თარგმანი = ენა[გასაღები]
        if(თარგმანი){
            თარგმნები.push(თარგმანი)
        }
    }
    return თარგმნები
}