var ნამცხვარი = require('./ნამცხვარი')
var სია = {}
exports.სია = სია

exports.ეს=function(მოთხ){
    return სია[სესიის_იდ]
}

exports.მომე_სესია=function(მოთხ, პასუხ){
    var სესიის_იდ=ნამცხვარი.მომე(მოთხ, 'სესიის-იდ')
    if(!სესიის_იდ){
        var შემოსვლის_დრო=new Date().getTime()
        var სესიის_იდ=შემოსვლის_დრო

        სია[სესიის_იდ]={
            შემოსვლის_დრო:შემოსვლის_დრო,
            პასუხ:პასუხ,
        }
        ნამცხვარი.მიე(პასუხ, 'სესიის-იდ', სესიის_იდ)
    }
    return სესიის_იდ
}