exports.ჩაუშვი=function(მოთხ, პასუხ, მომხმარებელი, მოდულები){
    if(!მოთხ.პარამები.ხ||
            !მოთხ.პარამები.ჯ||
            !მოთხ.პარამები.სიგანე||
            !მოთხ.პარამები.სიმაღლე){
        console.log('მომე-ფრაგმენტი: ცუდი მოთხოვნა')
        პასუხ.statusCode=400;
        პასუხ.end('ცუდი მოთხოვნა');
        return
    }
    
    მოდულები.საცავი.მომე_ფრაგმენტი(
                +მოთხ.პარამები.ხ,
                +მოთხ.პარამები.ჯ,
                +მოთხ.პარამები.სიგანე,
                +მოთხ.პარამები.სიმაღლე,
                function(ფრაგ){
                    პასუხ.end(ფრაგ)
                })
}
