var ნამცხვარი = require('./ნამცხვარი')
var სია = {}
exports.სია = სია
var რიგი=0

exports.მომე = function(მოთხ, პასუხ, მოდულები) {
    var სესიის_იდ = ნამცხვარი.მომე(მოთხ, 'სესიის-იდ')
    var მომხმარებელი
    if (სესიის_იდ) {
        მომხმარებელი = სია[სესიის_იდ]
    }
    if (!მომხმარებელი) {
        var შემოსვლის_დრო = new Date().getTime(),
            სესიის_იდ = შემოსვლის_დრო,
            სახელი = ნამცხვარი.მომე(მოთხ, 'სახელი')
    
        if(!სახელი){
            სახელი='მეგობარი '+Math.round(Math.random()*100000)
        }

        მომხმარებელი = {
            რიგის_ნომერი:++რიგი,
            სესიის_იდ: სესიის_იდ,
            შემოსვლის_დრო: შემოსვლის_დრო,
            ბოლო_აქტივობა: შემოსვლის_დრო,
            სახელი:სახელი,
            ფერი:'#000000',
            ხედვის_არე:{ხ:0,ჯ:0,სიგანე:0,სიმაღლე:0},
            შეცვალე_ხედვის_არე: function(ხ, ჯ, სიგანე, სიმაღლე) {
                this.ხედვის_არე = {ხ: ხ, ჯ: ჯ, სიგანე: სიგანე, სიმაღლე: სიმაღლე,
                    შუაწერტილი: {
                        ხ: ხ + Math.floor(სიგანე / 2),
                        ჯ: ჯ + Math.floor(სიმაღლე / 2),
                    }
                }
            },
            ველოდები_მოვლენას: function(პასუხ) {
                this.მოლოდინის_პასუხ = პასუხ
            },
            სასხვისე_ვარიანტი: function(){
                return {
                    რიგის_ნომერი:this.რიგის_ნომერი, 
                    სახელი:this.სახელი,
                    ფერი:this.ფერი,
                    შუაწერტილი:this.ხედვის_არე.შუაწერტილი
                }
            },
            აქტივობა:function(){
                this.ბოლო_აქტივობა=new Date().getTime()
                console.log('აქტივობა')
            }
        }

        სია[სესიის_იდ] = მომხმარებელი

        ნამცხვარი.მიე(პასუხ, 'სესიის-იდ', სესიის_იდ)
        ნამცხვარი.მიე(პასუხ, 'სახელი', მომხმარებელი.სახელი)
        
        var შეფუთული_ნაქნარი = მოდულები.ნაქნარები.დაამატე(მომხმარებელი, {
            ტიპი:"შემოვედი",
            მონაცემები:მომხმარებელი.სასხვისე_ვარიანტი()})
        exports.მიეცი_მომლოდინეებს(შეფუთული_ნაქნარი, მოდულები)
    }
    return მომხმარებელი
}

exports.მიეცი_მომლოდინეებს = function(ნაქნარი, მოდულები) {
    for (var ს in სია){
        var მომხმარებელი=სია[ს]
        if(მომხმარებელი.რიგის_ნომერი==ნაქნარი.მქმნელი){
            continue
        }
        if (მომხმარებელი.მოლოდინის_პასუხ) {
            მომხმარებელი.მოლოდინის_პასუხ.end(JSON.stringify(
                [მოდულები.ნაქნარები.გაფილტრე(მომხმარებელი, ნაქნარი)]))
            delete მომხმარებელი.მოლოდინის_პასუხ
        }
    }
}

setInterval(function(){
    var ახლა = new Date().getTime()
    for(var ს in სია){
        var მომხმარებელი = სია[ს]
        if(მომხმარებელი.ბოლო_აქტივობა+1000*60*10<ახლა){
            if(მომხმარებელი.მოლოდინის_პასუხ){
                მომხმარებელი.მოლოდინის_პასუხ.end('გამოცოცხლდი')
                მომხმარებელი.მოლოდინის_პასუხ=null
            }else{
                delete სია[ს]
                
//                var შეფუთული_ნაქნარი = მოდულები.ნაქნარები.დაამატე(
//                        მომხმარებელი, {ტიპი:"გავედი"})
//                exports.მიეცი_მომლოდინეებს(შეფუთული_ნაქნარი, მოდულები)
            }
        }
    }
}, 5000)