var ნაქნარები = []
exports.დაამატე = function(მომხმარებელი, ნაქნარი) {
    ნაქნარი.დრო = new Date().getTime()
    ნაქნარი.მქმნელი = მომხმარებელი

    ნაქნარები.push(ნაქნარი)
}

exports.მომე = function(მომხმარებელი, როდიდან) {
    return ნაქნარები.filter(function(ნაქ) {
        return ნაქ.დრო > როდიდან &&
                კვეთს_ხედვის_არეს(ნაქ, მომხმარებელი.ხედვის_არე)
    })
}

exports.კვეთს_ხედვის_არეს=function(ნაქნარი, ხედვის_არე) {
    return ნაქნარი.ხ >= ხედვის_არე.ხ &&
            ნაქნარი.ხ < ხედვის_არე.ხ + ხედვის_არე.სიგანე &&
            ნაქნარი.ჯ >= ხედვის_არე.ჯ &&
            ნაქნარი.ჯ < ხედვის_არე.ჯ + ხედვის_არე.სიმაღლე;
}

