var ნაქნარები = []
exports.დაამატე = function(მომხმარებელი, ნაქნარი) {
    var შეფუთული_ნაქნარი = {
        დრო: new Date().getTime(),
        მქმნელი: მომხმარებელი.რიგის_ნომერი,
        ტიპი: ნაქნარი.ტიპი,
        მონაცემები: ნაქნარი.მონაცემები,
    }
    ნაქნარები.push(შეფუთული_ნაქნარი)
    return შეფუთული_ნაქნარი
}

exports.მომე = function(მომხმარებელი, როდიდან) {
    var გაფილტრული=[]
    for(var ნ in ნაქნარები){
        var ნაქნარი = ნაქნარები[ნ]
        
        if(ნაქნარი.დრო <= როდიდან){
            continue
        }
        გაფილტრული.push(exports.გაფილტრე(მომხმარებელი, ნაქნარი))
    }
    return გაფილტრული
}

exports.კვეთს_ხედვის_არეს = function(ნაქნარი, ხედვის_არე) {
    var გზა = ნაქნარი.მონაცემები.გზა
    // ვგულისხმობთ, რომ ნაქნარი ხატვისაა
    for (var გ in გზა) {
        var ნაფეხური = გზა[გ]
        if (ნაფეხური.ხ >= ხედვის_არე.ხ &&
                ნაფეხური.ხ < ხედვის_არე.ხ + ხედვის_არე.სიგანე &&
                ნაფეხური.ჯ >= ხედვის_არე.ჯ &&
                ნაფეხური.ჯ < ხედვის_არე.ჯ + ხედვის_არე.სიმაღლე) {
            return true
        }
    }
    return  false
}

exports.გაფილტრე = function(მომხმარებელი, ნაქნარი){
    if(ნაქნარი.ტიპი=='დავხატე'){
        if(!exports.კვეთს_ხედვის_არეს(ნაქნარი, მომხმარებელი.ხედვის_არე)){
            var გაფილტრული = new Object(ნაქნარი)
            delete გაფილტრული.მონაცემები
            return გაფილტრული
        }
    }
    return ნაქნარი
}

setInterval(function(){
    var ახლა = new Date().getTime()
    for(var ნ in ნაქნარები){
        var ნაქნარი = ნაქნარები[ნ]
        
        if(ნაქნარი.დრო+1000*60*15<ახლა){
            delete ნაქნარები[ნ]
        }
    }
}, 5000)