var ნაქნარები = []
exports.დაამატე = function(მომხმარებელი, გზა) {
    var ნაქნარი = {
        დრო: new Date().getTime(),
        მქმნელი: მომხმარებელი.რიგის_ნომერი,
        გზა: გზა,
    }
    ნაქნარები.push(ნაქნარი)
    return ნაქნარი
}

exports.მომე = function(მომხმარებელი, როდიდან) {
    return ნაქნარები.filter(function(ნაქ) {
        return ნაქ.დრო > როდიდან &&
                exports.კვეთს_ხედვის_არეს(ნაქ, მომხმარებელი.ხედვის_არე)
    })
}

exports.კვეთს_ხედვის_არეს = function(ნაქნარი, ხედვის_არე) {
//    console.log('ნაქნარი', ნაქნარი)
//    console.log('ხედვის არე', ხედვის_არე)

    console.log('დაიწყო', ხედვის_არე)
    
    for (var ნ in ნაქნარი.გზა) {
        var ნაფეხური = ნაქნარი.გზა[ნ]
        console.log(ნაფეხური)
        if (ნაფეხური.ხ >= ხედვის_არე.ხ &&
                ნაფეხური.ხ < ხედვის_არე.ხ + ხედვის_არე.სიგანე &&
                ნაფეხური.ჯ >= ხედვის_არე.ჯ &&
                ნაფეხური.ჯ < ხედვის_არე.ჯ + ხედვის_არე.სიმაღლე) {
            console.log('დამთავრდა')
            return true
        }
    }
    console.log('დამთავრდა უარყოფითად')
    return  false
}

