var ნაქნარები = []
exports.დაამატე = function(მომხმარებელი, ნაქნარი) {
    var შეფუთული_ნაქნარი = {
        დრო: new Date().getTime(),
        მქმნელი: მომხმარებელი.რიგის_ნომერი,
        ტიპი: ნაქნარი.ტიპი,
        მონაცემები: ნაქნარი.მონაცემები,
    }
    ნაქნარები.push(შეფუთული_ნაქნარი)
    return შეფუთული_ნაქნარი
}

exports.მომე = function(მომხმარებელი, როდიდან) {
    return ნაქნარები.filter(function(ნაქ) {
        return ნაქ.დრო > როდიდან &&
                exports.კვეთს_ხედვის_არეს(ნაქ, მომხმარებელი.ხედვის_არე)
    })
}

exports.კვეთს_ხედვის_არეს = function(ნაქნარი, ხედვის_არე) {
    // ვგულისხმობთ, რომ ნაქნარი ხატვისაა
    for (var ნ in ნაქნარი.მონაცემები) {
        var ნაფეხური = ნაქნარი.მონაცემები[ნ]
        if (ნაფეხური.ხ >= ხედვის_არე.ხ &&
                ნაფეხური.ხ < ხედვის_არე.ხ + ხედვის_არე.სიგანე &&
                ნაფეხური.ჯ >= ხედვის_არე.ჯ &&
                ნაფეხური.ჯ < ხედვის_არე.ჯ + ხედვის_არე.სიმაღლე) {
            return true
        }
    }
    return  false
}

