var კითხვის_სიმი=require('querystring'),
    ურლ=require('url')
    
exports.ჩაუშვი=function(მოთხ, პასუხ, მომხმარებელი, მოდულები){
    
    if(მოთხ.პარამები.სიგრძე*მოთხ.პარამები.სიგანე>100000000){
        console.log('დავბლოკე მოთხოვნა ძალიან დიდ ფართობზე')
        პასუხ.end([])
    }
    
    var მომხდარი = მოდულები.ნაქნარები.მომე(
        მომხმარებელი.სესიის_იდ,
        მოთხ.პარამები.როდიდან,
        მოთხ.პარამები.ხ,
        მოთხ.პარამები.ჯ,
        მოთხ.პარამები.სიგანე,
        მოთხ.პარამები.სიმაღლე)
        
    if(მომხდარი){
        პასუხ.end(JSON.stringify(მომხდარი))
    }
} 
