var სიგრძე=1024, 
        სიგანე=1024,
        ფს=require('fs'),
        ნახაზი=require('canvas'),
        რუკა=new ნახაზი(სიგრძე, სიგანე)

function კიდურები(უკუძახილი){
    var მინ=null, მაქს=null
    ფს.readdir('საცავი', function(შეც, ფაილები){
        if(შეც){console.log(შეც); return}
        
        for(var ფ in ფაილები){
            var კოორდინატები = ფაილები[ფ].split('.'),
                ხ=+კოორდინატები[0],
                ჯ=+კოორდინატები[1]
            
            if(isFinite(ხ)&&isFinite(ჯ)){
                var აწყობილი = {ხ:ხ,ჯ:ჯ, სახელი:კოორდინატები}
                if(!მინ){
                    მინ=მაქს=აწყობილი
                    continue
                }
                console.log(აწყობილი)
                if(ხ<მინ.ხ&&ჯ<მინ.ჯ){
                    მინ=აწყობილი
                }
                if(ხ>მაქს.ხ&&ჯ>მაქს.ჯ){
                    მაქს=აწყობილი
                }
            }
        }
        უკუძახილი({მინ:მინ,მაქს:მაქს})
    })
    
}

//კიდურები(function(კიდურები){
//    
//  console.log(კიდურები)  
//})

