var კითხვის_სიმი=require('querystring'),
    ურლ=require('url')
    
exports.ჩაუშვი=function(მოთხ, პასუხ, მომხმარებელი, მოდულები){
    var პარ = კითხვის_სიმი.parse(ურლ.parse(მოთხ.url).query)
    
    if(პარ.სიგრძე*პარ.სიგანე>100000000){
        console.log('დავბლოკე მოთხოვნა ძალიან დიდ ფართობზე')
        პასუხ.end([])
    }
    
    var მომხდარი = მოდულები.ნაქნარები.მომე(
        მომხმარებელი.სესიის_იდ,
        პარ.როდიდან,
        პარ.ხ,
        პარ.ჯ,
        პარ.სიგანე,
        პარ.სიმაღლე)
        
    if(მომხდარი){
        პასუხ.end(JSON.stringify(მომხდარი))
    }
} 
