var საცხობი=function(){
    function ტექსტური(გასაღები, სასტარტო){
        var მნიშვნელობა=მომე_ნამცხვარი(გასაღები)
        if(!მნიშვნელობა){
            return სასტარტო
        }
        return მნიშვნელობა
    }
    function ციფრული(გასაღები, სასტარტო){
        var მნიშვნელობა=+მომე_ნამცხვარი(გასაღები)
        if(!მნიშვნელობა){
            return სასტარტო
        }
        return მნიშვნელობა
    }

    var ეს = {
        ხ:ციფრული('ხ',0),
        ჯ:ციფრული('ჯ',0),
        ენა:ტექსტური('ენა','ქართული-საქართველო'),
        მიჭირავს:ტექსტური('მიჭირავს','ხელი'),
        ფერი:ტექსტური('ფერი','#000000'),
        მიე_ფერი:function(ფერი){
            ეს.ფერი=ფერი
            მიე_ნამცხვარი('არჩეული_ფერი', ფერი)
        },
        მიე_ენა:function(ენა){
            ეს.ენა=ენა
            მიე_ნამცხვარი('ენა',ენა)
        },
        მიე_მიჭირავს:function(მიჭირავს){
            ეს.მიჭირავს=მიჭირავს
            მიე_ნამცხვარი('მიჭირავს',მიჭირავს)
        },
        შეინახე_მდებარეობა:function(){
            მიე_ნამცხვარი('ხ', ეს.ხ)
            მიე_ნამცხვარი('ჯ', ეს.ჯ)
        }
    }
    return ეს
}

function მომე_ნამცხვარი(სახელი){
    var ნამცხვრები = document.cookie.match(
            encodeURIComponent(სახელი)+"=(.*?)(;|$)")
    if(!ნამცხვრები){
        return 
    }
    return decodeURIComponent(ნამცხვრები[1])
}

function მიე_ნამცხვარი(სახელი, მნიშვნელობა){
    document.cookie=encodeURIComponent(სახელი)+'='+
            encodeURIComponent(მნიშვნელობა)
}