var საცხობი=function(){
    function ტექსტური(გასაღები, სასტარტო){
        var მნიშვნელობა=მომე_ნამცხვარი(გასაღები)
        if(!მნიშვნელობა){
            return სასტარტო
        }
        return მნიშვნელობა
    }
    function ციფრული(გასაღები, სასტარტო){
        var მნიშვნელობა=+მომე_ნამცხვარი(გასაღები)
        if(!მნიშვნელობა){
            return სასტარტო
        }
        return მნიშვნელობა
    }

    var ეს = {
        ხ:ციფრული('ხ',0),
        ჯ:ციფრული('ჯ',0),
        ენა:ტექსტური('ენა','ქართული-საქართველო'),
        მიჭირავს:ტექსტური('მიჭირავს','ხელი'),
        ფერი:ტექსტური('ფერი','#000000'),
        სახელი:ტექსტური('სახელი','მეგობარი 0001'),
        მიე_ფერი:function(ფერი){
            ეს.ფერი=ფერი
            მიე_ნამცხვარი('არჩეული_ფერი', ფერი, ერთი_თვის_მერე())
        },
        მიე_ენა:function(ენა){
            ეს.ენა=ენა
            მიე_ნამცხვარი('ენა',ენა, ერთი_თვის_მერე())
        },
        მიე_მიჭირავს:function(მიჭირავს){
            ეს.მიჭირავს=მიჭირავს
            მიე_ნამცხვარი('მიჭირავს',მიჭირავს, ერთი_თვის_მერე())
        },
        მიე_სახელი:function(სახელი){
            ეს.სახელი=სახელი
            მიე_ნამცხვარი('სახელი',სახელი, ერთი_თვის_მერე())
        },
        შეინახე_მდებარეობა:function(){
            მიე_ნამცხვარი('ხ', ეს.ხ, ერთი_თვის_მერე())
            მიე_ნამცხვარი('ჯ', ეს.ჯ, ერთი_თვის_მერე())
        }
    }
    return ეს
}

function მომე_ნამცხვარი(სახელი){
    var ნამცხვრები = document.cookie.match(
            encodeURIComponent(სახელი)+"=(.*?)(;|$)")
    if(!ნამცხვრები){
        return 
    }
    return decodeURIComponent(ნამცხვრები[1])
}

function მიე_ნამცხვარი(სახელი, მნიშვნელობა, ვადა){
    var მისაცემი=encodeURIComponent(სახელი)+'='+
            encodeURIComponent(მნიშვნელობა)
    if(ვადა){
        მისაცემი+=';expires='+new Date(ვადა).toUTCString()
    }
    document.cookie=მისაცემი
}

function ერთი_თვის_მერე(){
    var ახლა = new Date().getTime(),
        მერე=ახლა+1000*60*60*24*30
    return მერე
}