var ფს=require('fs')
var ნახაზი=require('canvas')

var ნახაზები={}
var ფრაგმენტის_ხ=1024, ფრაგმენტის_ჯ=1024

function მომე_მოზომილი_ფრაგმენტი(ხ, ჯ, უკუძახილი){
    var სახელი = Math.floor(ხ/ფრაგმენტის_ხ)+'-'+Math.floor(ჯ/ფრაგმენტის_ჯ)
    var ნახ=ნახაზები[სახელი]
    if(ნახ){
        უკუძახილი(ნახ)
    }
    ფს.readFile('საცავი/'+სახელი, function(შეც, შიგთავსი){
        ნახ=new ნახაზი(ფრაგმენტის_ხ,ფრაგმენტის_ჯ)
        ნახ.სახელი=სახელი
        ნახ.ხ=ხ-ხ%ფრაგმენტის_ხ
        ნახ.ჯ=ჯ-ჯ%ფრაგმენტის_ჯ
        ნახაზები[სახელი]=ნახ
        if(შეც) { // ანუ ფაილი ჯერ არ არსებობს და ნახაზი ცარიელია
            console.log(შეც)
            // აქ შეიძლება ჩაიდოს ახალი ნახაზის ფაილად შენახვა
            უკუძახილი(ნახ)
            return
        }
        var სურ = new ნახაზი.Image
        სურ.src=შიგთავსი
        ნახ.drawImage(სურ, 0, 0, ფრაგმენტის_ხ, ფრაგმენტის_ჯ)
        უკუძახილი(ნახ)
    })
}
function მომე_შესაცვლელი_ფრაგმენტები(ნაქნარი1, ნაქნარი2, უკუძახილი){
    მომე_მოზომილი_ფრაგმენტი(ნაქნარი1.ხ, ნაქნარი1.ჯ, function(ნახ1){
        მომე_მოზომილი_ფრაგმენტი(ნაქნარი2.ხ, ნაქნარი2.ჯ, function(ნახ2){
            if(ნახ1==ნახ2){
                უკუძახილი([ნახ1])
            }else{
                უკუძახილი([ნახ1, ნახ2])
            }
        })
    })
}

exports.მიახატე=function(ნაქნარი){
    for(var ი=1;ი<ნაქნარი.length;ი++){
        var ნაქ=ნაქნარი[ი]
        var წინა_ნაქ=ნაქნარი[ი-1]
        
        მომე_შესაცვლელი_ფრაგმენტები(ნაქ, წინა_ნაქ, function(ფრაგმენტები){
            for(var ფ in ფრაგმენტები){
                var ფრაგმენტი = ფრაგმენტები[ფ]
                var ხ=ნაქ.ხ-ფრაგმენტი.ხ,
                    ჯ=ნაქ.ჯ-ფრაგმენტი.ჯ,
                    წინა_ხ=წინა_ნაქ.ხ-ფრაგმენტი.ხ,
                    წინა_ჯ=წინა_ნაქ.ჯ-ფრაგმენტი.ჯ
                    
                var კონტ = ფრაგმენტი.getContext('2d')
                    
                კონტ.moveTo(წინა_ხ,წინა_ჯ)
                კონტ.lineTo(ხ,ჯ)
                კონტ.stroke()
                
                //ფს.writeFile()
            }
            
            
            console.log('ე, ახლა წეიღეთ აი კანვასები საცხა!')
        })
    }
}
exports.მომე_ფრაგმენტი=function(ხ,ჯ,სიგანე,სიმაღლე){
    
} 
