var საფერე = function(ელემენტი, საწყისი_ფერი, უკუძახილი){
    var ნახაზი = document.createElement('canvas'),
            კონტ = ნახაზი.getContext('2d'),
            გამადიდებელი = document.createElement('div')
          
    ნახაზი.id='ფერების_ასარჩევი_ნახაზი'
    
    ნახაზი.width=170;
    ნახაზი.height=50;
        console.log(ნახაზი.width, ნახაზი.height)
        
    var მონაცემები = კონტ.createImageData(ნახაზი.width, ნახაზი.height)
    
    for(var ი=0;ი<მონაცემები.width;ი++){
        for(var კ=0;კ<მონაცემები.height;კ++){
            var მის = (ი+კ*მონაცემები.width)*4,
                სიგანის_პროცენტი=ი/მონაცემები.width
        
            var მეექვსედი = Math.floor(სიგანის_პროცენტი/(1/6)),
                    მეექვსედში_პროცენტი = (სიგანის_პროცენტი%(1/6))/(1/6),
                    წითლის_შერევა, მწვანეს_შერევა, ლურჯის_შერევა
            
            switch(მეექვსედი){
                case 0:
                    წითლის_შერევა=1
                    მწვანეს_შერევა=მეექვსედში_პროცენტი
                    ლურჯის_შერევა=0
                    break
                case 1:
                    წითლის_შერევა=1-მეექვსედში_პროცენტი
                    მწვანეს_შერევა=1
                    ლურჯის_შერევა=0
                    break
                case 2:
                    წითლის_შერევა=0
                    მწვანეს_შერევა=1
                    ლურჯის_შერევა=მეექვსედში_პროცენტი
                    break
                case 3:
                    წითლის_შერევა=0
                    მწვანეს_შერევა=1-მეექვსედში_პროცენტი
                    ლურჯის_შერევა=1
                    break
                case 4:
                    წითლის_შერევა=მეექვსედში_პროცენტი
                    მწვანეს_შერევა=0
                    ლურჯის_შერევა=1
                    break
                case 5:
                    წითლის_შერევა=1
                    მწვანეს_შერევა=0
                    ლურჯის_შერევა=1-მეექვსედში_პროცენტი
                    break
            }
            
            var ნახევარ_სიმაღლის_პროცენტი=
                    (კ%(მონაცემები.height/2))/(მონაცემები.height/2),
                წითელი=255*წითლის_შერევა, 
                მწვანე=255*მწვანეს_შერევა, 
                ლურჯი=255*ლურჯის_შერევა
            
            if(კ<მონაცემები.height/2){
                წითელი+=(255-წითელი)*(1-ნახევარ_სიმაღლის_პროცენტი)
                მწვანე+=(255-მწვანე)*(1-ნახევარ_სიმაღლის_პროცენტი)
                ლურჯი+=(255-ლურჯი)*(1-ნახევარ_სიმაღლის_პროცენტი)
            }else{
                წითელი*=1-ნახევარ_სიმაღლის_პროცენტი
                მწვანე*=1-ნახევარ_სიმაღლის_პროცენტი
                ლურჯი*=1-ნახევარ_სიმაღლის_პროცენტი
            }
        
            მონაცემები.data[მის]=წითელი;
            მონაცემები.data[მის+1]=მწვანე;
            მონაცემები.data[მის+2]=ლურჯი;
            მონაცემები.data[მის+3]=255;
        }
    }

    გადახატე_ნახაზი()
    
    გადახატე_მიმთითებელი(0,0,'#0F0')
    
    var დაჭერილი = false
    ნახაზი.addEventListener('mousedown', function(მოვლ){
        if(მოვლ.button===0){
            დაჭერილი=true
            გადახატე_ნახაზი()
            გადახატე_მიმთითებელი(მოვლ.layerX, მოვლ.layerY, '#0F0')
        }
    })
    
    ნახაზი.addEventListener('mousemove', function(მოვლ){
        if(მოვლ.button===0&&დაჭერილი){
            გადახატე_ნახაზი()
            გადახატე_მიმთითებელი(მოვლ.layerX, მოვლ.layerY, '#0F0')
        }
    })
    
    ნახაზი.addEventListener('mouseleave', function(მოვლ){
        if(მოვლ.button===0&&დაჭერილი){
            უკუძახილი(ამოიღე_ფერი(მოვლ.layerX, მოვლ.layerY))
        }
    })
    
    ნახაზი.addEventListener('mouseup', function(მოვლ){
        if(მოვლ.button===0){
            დაჭერილი=false
            უკუძახილი(ამოიღე_ფერი(მოვლ.layerX, მოვლ.layerY))
        }
    })
    
    window.addEventListener('mouseup', function(მოვლ){
        if(მოვლ.button===0){
            დაჭერილი=false
        }
    })
    
    window.addEventListener('mouseleave', function(მოვლ){
        if(მოვლ.button===0){
            დაჭერილი=false
        }
    })
    
    function ამოიღე_ფერი(ხ,ჯ){
        var მისამართი = (ხ+მონაცემები.width*ჯ)*4
            წითელი = მონაცემები.data[მისამართი],
            მწვანე = მონაცემები.data[მისამართი+1],
            ლურჯი = მონაცემები.data[მისამართი+2]
    
        return 'rgb('+წითელი+','+მწვანე+','+ლურჯი+')'
    }
    
    ელემენტი.appendChild(ნახაზი)
    ელემენტი.appendChild(გამადიდებელი)
    
    function გადახატე_ნახაზი(){
        კონტ.putImageData(მონაცემები, 0, 0)
    }
    function გადახატე_მიმთითებელი(ხ, ჯ, ფერი){
        
        console.log(ნახაზი.height)
        კონტ.beginPath()
        კონტ.fillStyle=ფერი
        კონტ.strokeStyle='rgb(0,0,0,0.5)'
        
        კონტ.moveTo(ხ,0)
        კონტ.lineTo(ხ,ნახაზი.height)
        კონტ.stroke()
        
        კონტ.moveTo(0,ჯ)
        კონტ.lineTo(ნახაზი.width,ჯ)
        კონტ.stroke()
        
//        კონტ.strokeRect(0,0,20,20)
//        კონტ.fillRect(0,0,20,20)
    }
    
    
    return {}
}
function ჩასვი_ფერების_ასარჩევი(ელემენტი, საწყისი_ფერი, უკუძახილი){
    function ფერის_ნაწყვეტი(ფერი){
        var ელ = document.createElement('div')
        ელ.style.backgroundColor=ფერი
        ელ.className='ფერის_ყუთი'
        if(საწყისი_ფერი==ფერი){
            ელ.className+=' მონიშნული_ფერის_ყუთი'
        }
        
        ელ.onclick=function(){
            ფერის_ყუთები.forEach(function(ფერის_ყუთი){
                ფერის_ყუთი.className='ფერის_ყუთი'
            })
            ელ.className='ფერის_ყუთი მონიშნული_ფერის_ყუთი'
            უკუძახილი(ფერი)
        }
        return ელ
    }
    
    var ჩარჩო = document.createElement('div')
    ჩარჩო.style.position='relative'
    ჩარჩო.style.height='22px'
    
    var ფერის_ყუთები=[
        ფერის_ნაწყვეტი('#000000'),
        ფერის_ნაწყვეტი('#FF0000'),
        ფერის_ნაწყვეტი('#FFFF00'),
        ფერის_ნაწყვეტი('#00FF00'),
        ფერის_ნაწყვეტი('#00FFFF'),
        ფერის_ნაწყვეტი('#0000FF'),
        ფერის_ნაწყვეტი('#FFFFFF')]
    
    ფერის_ყუთები.forEach(function(ფერის_ყუთი){
        ჩარჩო.appendChild(ფერის_ყუთი)
    })
    
    ელემენტი.appendChild(ჩარჩო)
}